{
    "general": {
        "beginning_date": "data",
        "technologies": "technologie",

        "menu": {
            "tab1": "Strona Główna",
            "tab2": "Projekty",
            "tab3": "Umiejętności",
            "tab4": "Doświadczenie"
        },
        "slider": {
            "title": "Portfolio najlepsze jest szczere...",
            "subtitle": "...i to takie na zawsze pozostanie"
        },
        "footer": {
            "title": "Znajdź mnie na:"
        }
    },
    "main": {
        "title": {
            "text": "Witam!",
            "subtext1": "Nazywam się Hubert Siwczyński, mam ",
            "subtext2": " lat i interesuję się Informatyką od kiedy pamiętam. \nNa tej strone chciałbym Ci pokazać kim jestem, omówić moje projekty oraz rzeczy, którymi się interesuję."
        },
        "paragraphs": {
            "first": {
                "title": "Kocham odkrywać nowe rzeczy",
                "text": "Jak dotąd każdy nowy projekt, który zrobiłem ma w sobie coś innego. Zawsze dbam o to, żeby to co robie było kreatywne i przyciągało uwagę innych."
            },
            "second": {
                "title": "Staram się rozwijać w wielu dziedzinach",
                "text": "W swoim życiu celuję w wszechstronność. Głównym ścieżką, którą sobie wyznaczyłem jest tworzenie aplikacji webowych, aczkolwiek staram się rozwijać także swoje inne, komputerowe pasje, tj. tworzenie gier, obróbka grafiki, rysowanie, tworzenie muzyki czy montaż filmów. Od zawsze kręciły mnie rzeczy wielkie."
            },
            "third": {
                "title": "Jestem i będę na zawsze sobą",
                "text": "Jestem osobą dość ciekawską, którą interesują rzeczy kreatywne. Lubię zawierać nowe i sensowne znajomości. Jestem odważny co do nowych rzeczy. Niezbyt mi odpowiada sztywna i poważna atmosfera, lecz sam wolę słuchać niż mówić."
            }
        }
    },
    "projects" : {
        "big_title" : "W tej sekcji prezentuję projekty największe, dla szerszej publiczności bądź które posiadają ważniejsze znaczenie",
        "medium_title": "Tutaj znajdziesz projekty, które nie są ani zbyt małe ani specjalnie duże",
        "small_title": "Są tutaj rzeczy małe, które służyły mi najczęściej do testów bądź poznania języka",
        "categories": {
            "large": "Duże",
            "medium": "Średnie",
            "small": "Małe"
        },

        "menu": {
            "title": "Projekty",
            "subtitle": "W tej sekcji wymienię projekty, które wykonałem bądź były w trakcie realizacji przeze mnie",
            "tabs": {
                "first": "Projekty mniejsze",
                "second": "Średniaki",
                "third": "Projekty większe"
            }
        },

        "theSquirrelDragon" : {
            "title": "Kryptonim: TheSquirreldragon",
            "date": "listopad 2019",
            "technologies": "React, Sass, Node.js, Next.js, MongoDB",
            "description": "Projekt ten ma być dla osób, które chciałyby znaleźć kogoś o podobnych do nich zainteresowaniach. Na razie nie chciałbym ujawniać zbyt wielu szczegółów jednak. W przeciwieństwie do Blackrats pomysł ten jest do zrealizowania w jedną osobę i posiada duże możliwości rozwoju. Jak na razie projekt ten dotarł do momentu, w którym udało mi się rozplanować całą jego mechanikę i połowę z niej już napisać."
        },
        "blackrats_second": {
            "title": "Blackrats - podejście drugie i trzecie",
            "date": "2018 rok",
            "technologies": "Pug (potem React), Node.js, Next.js, MongoDB",
            "description": "Do tych wersji projektu Blackrats rozpoczętych w 2018 roku przystąpiliśmy we 2 osoby z moim rosyjskim znajomym. Niestety ale świat jest okrutny i duża różnica czasu jest między nami, dlatego trudno było nam się zgrać, przez co wielkość projektu oraz brak czasu nas przygniotły i obaj uznaliśmy że nie ma na razie sensu go dalej kontynuować. W tym miejscu po raz pierwszy posmakowałem NodeJSa i go pokochałem. Dotarliśmy do tego samego momentu co w wersji pierwszej, aczkolwiek tym razem, nawet powracając do niego po długim czasie wiem co gdzie się znajduje i byłbym w stanie go kontynuować."
        },
        "wspoldzielnia": {
            "title": "Współdzielnia",
            "date": "2017 rok",
            "technologies": "HTML, CSS, JQuery, PHP, Symfony, Firebase",
            "description": "Projekt rozpoczęty w trakcie pisania pierwszej wersji Blackrats w 2017 roku. Będąc na umowie-zlecenie pisałem wraz ze znajomym z liceum duży projekt dla zleceniodawcy z Tarnowa podgórnego, za który miałem otrzymać 10% zysku. Ja pisałem stronę (wtedy jeszcze nie wiedziałem że Symfony nie jest dobrym frameworkiem dla sklepów internetowych). Pan ten na szczęście okazał się być na tyle nietrafny, że uznałem ten projekt za fikcję i szybko się z nim rozstałem. Dodatkowo postanowiłem lepiej przygotować się na zbliżające się matury."
        },
        "Blackrats_first": {
            "title": "Blackrats - wersja pierwsza",
            "date": "2016 rok",
            "technologies": "HTML, CSS, JQuery, PHP, Symfony, SQL",
            "description": "Pierwsza wersja projektu Blackrats rozpoczęta w 2016 roku, którą rozwijałem sam. Jest on bardzo ciekawym pomysłem, który być może kiedyś kontynuuję. Polegał on na zbudowaniu czegoś w stylu Fiverr, lecz z większym polem do popisu dla początkujących. Napisana na frameworku Symfony struktura projektu posiada działającą możliwość logowania i rejestracji, jak i możliwość personalizacji profilu. Z projektu w tym formacie zrezygnowałem ponieważ sam framework był zbyt duży jak na mnie."
        },
        "OS_Symulator": {
            "title": "Symulator systemu operacyjnego",
            "date": "listopad 2019",
            "technologies": "C++",
            "description": "Ten projekt został napisany w C++, w celu zaliczenia przedmiotu Systemy Operacyjne. Miał symulować działanie prawdziwego systemu operacyjnego. Był pisany w 7 osób i każda z nich miała do przygotowania jeden z modułów. Mnie się wylosował interpreter asemblera. Były jeszcze: procesor, procesy, zamki, dysk, interfejs i pamięć RAM. W projekcie udaje się działać na procesach i programach, natomiast nie działa system i-węzłów, co było główną przyczyną rozpadu drużyny w przeddzień oddania."
        },
        "assembler": {
            "title": "Interpreter Asemblera",
            "date": "marzec 2020",
            "technologies": "C++",
            "description": "Jest to projekt wykonany przeze mnie dla indywidualnego zaliczenia przedmiotu po rozpadzie drużyny i klęsce w pierwszym terminie. Do całego programu miałem wykonać prosty interfejs pozwalający na sprawdzenie poprawności działania. Projekt po zaliczeniu niestety zginął i nie mogę znaleźć jego kodu źródłowego do pokazania."
        },
        "game_2048": {
            "title": "Gra 2048",
            "date": "Październik 2020",
            "technologies": "React",
            "description": "Gra bazowana na popularnym 2048, zrobiona w Reakcie. Ma możliwość customizacji całej planszy, jak i 2 tryby predefiniowane - jeden standardowy 4x4, a drugi mój własny 5x4 z liczbami ujemnymi."
        },
        "theImpossibleGame": {
            "title": "Gra \"The Impossible Game\"",
            "date": "czerwiec 2019",
            "technologies": "C++, SFML",
            "description": "Gra komputerowa napisana w bibliotece SFML dla C++, która jest kopią znanej flashowej gry World’s Hardest Game. Warto wspomnieć, że na jej wykonanie miałem 3 dni, gdzie zaczynałem mając zerowe pojęcie o tej bibliotece. Gra działa identycznie jak w przedstawionej wyżej produkcji. Posiada 3 poziomy, system checkpointów i monetki do zdobycia."
        },
        "portfolioWiewiorka": {
            "title": "Portfolio wiewiorka",
            "date": "czerwiec 2020",
            "technologies": "SASS, Typescript, Angular",
            "description": "Ten projekt właśnie przeglądasz :). Specjalny projekt wykonany aby zdobyć jakieś ciekawe praktyki na studia i żeby mieć czym się pochwalić podczas szukania pracy. Specjalnie dla niego nauczyłem się Angulara i Typescripta. Na wszystko poświęciłem sporo czasu, prawie 2 miesiące z dużymi przerwami."
        },
        "nextjsTemplates": {
            "title": "Szablony do Next.js",
            "date": "luty - marzec 2020",
            "technologies": "React, JavaScript, Next.js, MongoDB",
            "description": "W trakcie pisania aplikacji wpadłem na pomysł, żeby zrobić templatkę do Next.js, którą będzie można użyć do wielu projektów. Wersja podstawowa (simple) posiada obsługę wielu języków, podstawowych błędów, oraz posiada moduł obsługi logów. Przeznaczona jest do tworzenia statycznych stron dla klientów. Wersja rozszerzona (advanced) posiada obsługę bazy danych MongoDB, sesję oraz podstawowy panel logowania i rejestracji oraz możliwość zmiany swojego profilu. Przeznaczona jest do większych projektów."
        },
        "UDP_Python": {
            "title": "Przesył UDP",
            "date": "kwiecień 2019",
            "technologies": "Python",
            "description": "Projekt robiony w 2 osoby na zaliczenie przedmiotu Technologie Sieciowe polegający na nawiązaniu transmisji UDP pomiędzy klientem a serwerem (1 do 1) w Pythonie. Aplikacja pyta się czy ma działać po stronie klienta czy serwera. Następnie działa w następujący sposób: Prosi klienta o podanie operacji która ma zostać wykonana oraz liczby które mają podlec operacji. Następnie w sposób bezpołączeniowy wysyła dane do serwera, po czym serwer wykonuje operacje na danych i wysyła z powrotem wynik."
        },
        "Hamownia_drogowa": {
            "title": "Aplikacja dla hamowni drogowej",
            "date": "kwiecień 2020",
            "technologies": "Python",
            "description": "Sam projekt hamowni tworzony był w 3 osoby, natomiast aplikacją okienkową w Pythonie do jego obsługi zajmowałem się głównie ja. Pozwala ona na wpisanie odpowiednich parametrów takich jak: masa pojazdu, średnica felgi, profil opony itd. Następnie, po wczytaniu odpowiednich danych z czujnika szczelinowego wyznacza wykres RPM oraz moc silnika. Aplikacja posiada system walidujący dane oraz wygładzający wykres."
        },
        "chat": {
            "title": "Czat PHP",
            "date": "2016 rok",
            "technologies": "HTML, CSS, JQuery, PHP, MySQL",
            "description": "Zrobiony w PHP czat z tablicą użytkowników był jednym z pierwszych projektów które zrobiłem. Użytkownik był w stanie podać nick i wejść na czat, a gdy wyszedł wszyscy inni zalogowani to widzieli. Na czacie można było pisać, a o nowej wiadomości użytkownik był informowany i jego okno automatycznie się scrollowało w dół. Projekt ten w 2017 roku wsadziłem na darmowy serwer cba.pl, który już dziś nie istnieje i zaprosiłem na niego znajomych."
        },
        "checkers": {
            "title": "Warcaby",
            "date": "2017 rok",
            "technologies": "HTML, CSS, JQuery",
            "description": "Zrobione w JavaScript warcaby posiadają możliwość zbijania i poruszania pionkami, oraz zamianę na damki. Jest to projekt, który robiłem po czacie, lecz nigdy go nie skończyłem, natomiast umieszczam tu jego kod tak na pamiątkę."
        },
        "microscope": {
            "title": "Mikroskop",
            "date": "2017 rok",
            "technologies": "HTML, LESS, JQuery",
            "description": "Zrobiłem go, ponieważ zauważyłem w pewnym sklepie internetowym możliwość przybliżenia zdjęcia i byłem ciekawy jak to działa. W mojej wersji jednak możemy określić skalę przybliżenia."
        }
    },
    "skills": {
        "menu": {
            "title": "Umiejętności",
            "subtitle": "W tej sekcji opiszę pokrótce programy, z których potrafię korzystać i języki w których operuję"
        },
        "group1": {
            "title": "Programy Adobe Creative Cloud"
        },
        "group2": {
            "title": "Języki programowania, markupy i bazy danych",
            "subgroup1": "Języki Webowe",
            "subgroup2": "Języki do aplikacji desktopowych",
            "subgroup3": "Języki bazodanowe"
        },
        "group3": {
            "title": "Biblioteki i frameworki",
            "subgroup1": "JavaScript",
            "subgroup2": "HTML/CSS",
            "subgroup3": "PHP",
            "subgroup4": "C++"
        },
        "group4": {
            "title": "Języki tradycyjne"
        },
        "group5": {
            "title": "Programy do tworzenia i obróbki muzyki"
        },
        "group6": {
            "title": "Programy do obróbki wideo"
        },
        "group7": {
            "title": "Programy biurowe Microsoft Office"
        },
        "photoshop": {
            "title": "Adobe Photoshop",
            "description": "Programem tym interesuję się od bardzo dawna (stosowałem go do przeróbek zdjęć tj. wycinanie tła itp.), aczkolwiek zacząłem się nim zajmować i tworzyć jakieś ciekawsze projekty od stycznia 2020, kiedy zacząłem przerabiać losowe zdjęcia rodziny i znajomych. Wiem jak zrobić podstawową obróbkę obrazu, skorygować go, oraz jak nałożyć filtry. Moim zdaniem jeszcze daleko mi do profesjonalisty, gdyż program ten posiada wiele zaawansowanych funkcji, jednak staram się uczyć ich stopniowo na nowych projektach, gdzie dorzucam coś nowego. Jak na razie wszystkie moje przeróbki zaskoczyły moich znajomych i rodzinę."
        },
        "illustrator": {
            "title": "Adobe Illustrator",
            "description": "To jest moim zdaniem najlepszy program, z jakiego korzystałem. Ile wiewiórek narysowałem w nim tego na palcach zliczyć nie można. Jedyny taki program, który mnie nigdy nie zmęczy i przy którym mogę siedzieć non-stop. Potrafię rysować rysunki z konturami i bez nich, z gradientem i bez, oraz tak szczegółowe, że mi pamięci brakuje w komputerze. Umiem nakładać filtry na obrazki. Staram się używać także różnych pędzli malarskich, a także tworzyć swoje. W przyszłości chciałbym moje rysunki animować w After Effects i tworzyć scenki. Testowałem także program Inkscape. Na pewno program ten jest szybszy, lecz ma mniej intuicyjny interfejs."
        },
        "html": {
            "title": "HTML 5",
            "description": "Tak jak życie nie obejdzie się bez śmierci i podatków, tak programista webowy bez znajomości HTMLa. Nigdy nie korzystałem z wersji czwartej. Staram się w miarę możliwości korzystać nie tylko z divów, ale także z nowszych tagów HTMLa 5, takich jak: article, section, main, header itd."
        },
        "css": {
            "title": "CSS 3",
            "description": "Zazwyczaj tworzenie strony rozpoczynam od dania dla każdego elementu na stronie atrybutu display na wartość flex. Znam dobrze flexboxa, transition i gradienty. Umiem korzystać z atrybutu position bez większych zaskoczeń. Dałbym sobie radę z takimi problemami jak stworzenie trójkąta, dymka czy rombu, jak i trudniejszymi związanymi typowo z umiejscowieniem elementów."
        },
        "javascript": {
            "title": "JavaScript",
            "description": "Na samym początku mojego działania z programowaniem webowym zrezygnowałem z czystego JSa i zacząłem od razu korzystać z JQuery. Natomiast wraz z kolejnymi wejściami nowszych standardów odkryłem, że biblioteka ta jest zbędna i zacząłem się uczyć czystego JavaScripta. Teraz już nie wiem czego w nim nie umiem. Jest to bardzo rozbudowany język, w którym cenię elastyczność i niską wrażliwość składniową, co daje mi poczucie wolności gdy w nim piszę. Umiem pracować na funkcjach asynchronicznych, tablicach, klasach i obiektach. Umiem uruchomić nim ivonę, czytać pliki File Readerem, łapać i reagować na błędy promisami. Staram się być na bieżąco w najnowszymi standardami."
        },
        "typescript": {
            "title": "Typescript",
            "description": "Jest to javascript z typami. Podoba mi się to, że podanie typów włącza możliwość podpowiedzi od IDE w miejscach, których typu nie może się domyślić. Wprowadza też hermetyzację do klas. Zostałem do niego przekonany, stworzyłem z nim projekt i mi przypadł do gustu."
        },
        "php": {
            "title": "PHP",
            "description": "Jest bardzo ciekawym i rozbudowanym językiem serwerowym, jednak samo to, że trzeba zmieniać język w którym się myśli skłoniło mnie do przejścia na node.jsa. Mam z nim wiele wspomnień, gdyż to był język w którym zaczynałem pisać pierwsze aplikacje webowe. Większość jego frameworków typu Laravel czy Symfony jest dla dużych i ciężkich projektów."
        },
        "cpp": {
            "title": "C++",
            "description": "Język który towarzyszy mi od początku i jeszcze pewnie potowarzyszy. Umiem operować zarówno w nim jak i w czystym C. Wiem jak operować na wskaźnikach (gwiazdkowych, jak i shared pointerach), tablicach dynamicznych, wyrażeniach lambda, wątkach, mapach, stosach, listach itd. Znam się na obiektach i własnościach klas. Nie lubię przymusu podawania w nim wszędzie typów zmiennych, dla mnie jest to język dość nieelastyczny."
        },
        "python": {
            "title": "Python",
            "description": "Ten język jest jak Wordpress dla programisty okienkowego. Wszystko jest wbudowane, można pisać w nim programy zarówno obiektowo, jak i liniowo. Do wielu rzeczy nad którymi bym w C++ 2 godziny siedział, tu wystarczy wczytać odpowiednią bibliotekę i napisać 5 linijek. Język jest przyjemny, lecz moim zdaniem aż zbyt prosty. W mojej opinii jest beznadziejnym językiem na rozpoczęcie nauki… bo masy rzeczy tak naprawdę nie uczy. Gdy tylko mam dowolność wyboru języka na studiach to w nim wszystko piszę, bo napisanie projektu na który przeznaczone jest 5 miesięcy, zajmuje mi 2 dni. Na razie miałem do czynienia z bibliotekami takimi jak: Tkinter, Matplotlib, socket, i xml"
        },
        "sql": {
            "title": "SQL",
            "description": "Język bazodanowy, którego celem jest rozdzielenie zależności na wiele tabel, a potem połączenie ich relacjami. Wolę jednak jsonowe bazy danych, ponieważ nie muszę się przerzucać pomiędzy ogromem tabel i wszystko mam zapisane w jednej. Umiem w nim skonstruować triggery, procedury, odczytywać dane w formacie xml. Pierwszą styczność z nim miałem podczas zabawy z językiem PHP. Działałem już z MySQL, SQL Server i PostgreSQL."
        },
        "mongodb": {
            "title": "MongoDB",
            "description": "Język ten jest najprzyjemniejszym językiem bazodanowym, z jakim miałem okazję się spotkać. Stawiam go na czele elastyczności. Nie ma tak wiele dodatków jak Firebase, ale daje możliwość dostępu do danych użytkowników, w razie chęci zmiany hostingu. Nawiązanie połączenia i otrzymanie danych także nie należy do skomplikowanych rzeczy. Wspiera wiele platform i ma wiele wtyczek."
        },
        "firebase": {
            "title": "Firebase",
            "description": "Maszynka do zarabiania pieniędzy napisana przez firmę Google. Wąż ten kusi wieloma udogodnieniami lecz we wnętrzu jest skonstruowany tak, abyś w razie powodzenia nie był w stanie go opuścić. Nie daje żadnego dostępu do danych użytkowników, jak i możliwości zapisu ich gdzie indziej niż w panelu autoryzacji (ponieważ nie da się wtedy napisać reguł dla bazy). Korzystałem z niej raz i mnie nie zachwyciła szczególnie że jej głównym zabezpieczeniem są właśnie reguły. Nadaje się idealnie do projektów real-time oraz tych małych, statycznych aplikacji, ze względu na multum dodatków, które posiada."
        },
        "nodejs": {
            "title": "Node.js",
            "description": "Przesiadłem się na niego z Apache, gdy uznałem, że warto by poznać inne technologie niż PHP. Podoba mi się sam pomysł pisania w Javascript po stronie serwera. Umiem korzystać z wielu zależności, eksportować i importować moduły. Znam podstawowe paczki do budowania stron, jak multer, czy bcrypt."
        },
        "react": {
            "title": "React",
            "description": "Uważam ten framework za bardzo przyjemny i niezwykle elastyczny. Można zrobić w nim dosłownie wszystko bez używania zbędnych bibliotek typu jQuery. Podoba mi się w nim możliwość importowania komponentów i to, że render HTMLa następuje w JavaScripcie, przez co kod JavaScripta można wpinać bezpośrednio do HTMLa. Można całą witrynę zrobić albo na klasach albo na funkcjach z tzw hookami – ja wolę na klasach. Jak na razie jest to mój ulubiony framework i szybko go nic nie pobije."
        },
        "angular": {
            "title": "Angular",
            "description": "Pierwszy raz z Angularem zetknąłem się robiąc to portfolio. Jest on dla ludzi, którzy lubią rozwarstwiać strukturę aplikacji na wiele plików. Nie jest tak elastyczny jak React i wymaga pisania wszystkich funkcji w komponentach. Jak na razie znam kompletne podstawy i potrafię robić w nim jedynie strony typu wizytówka z podstawowym routingiem i wieloma językami korzystając z i18n. Nauczyłem się go głównie z kursu na Udemy."
        },
        "nextjs": {
            "title": "Next.js",
            "description": "Postanowiłem, że napiszę o nim osobno, ponieważ jest on genialnym dodatkiem, ułatwiającym konfigurację strony. Pomaga on w konfiguracji webpacka pod dodatki typu scss, czy babel (wystarczy zaimportować odpowiednią paczkę w pliku konfiguracji), oraz wprowadza do strony automatyczny routing, dzięki czemu wystarczy wsadzić plik JavaScripta do katalogu, aby strona stała się dostępna z poziomu przeglądarki. Dobrą rzeczą jest też plik konfiguracyjny _app.js, który zostaje uruchomiony przy wejściu na dowolną stronę, oraz _document.js, który pozwala na utworzenie własnego szkieletu bazowego strony."
        },
        "jquery": {
            "title": "JQuery",
            "description": "Biblioteka z którą spędziłem wiele lat i znam ją na wylot. Ratowała deweloperów stron przez wiele lat, kiedy czysty JavaScript jeszcze kulał. Dobrze systematyzuje pobieranie elementów z DOM, ma łatwe w użyciu funkcje, które są kompatybilne ze starszymi przeglądarkami. React moim zdaniem ją pokrywa w 100% przy okazji daje ciekawsze efekty i zmniejsza ilość pisanego kodu, dlatego w miarę możliwości wolę iść w jego stronę. Z roku na rok biblioteka ta staje się coraz mniej użyteczna, jednak mam do niej spory sentyment."
        },
        "pug": {
            "title": "Pug",
            "description": "Z pugiem miałem mało do czynienia, ale miałem. Korzystałem z niego jeszcze przed zastosowaniem Reacta. Jest to dobre rozwiązanie dla prostych stron. Ma możliwość podziału strony na bloki i możliwość importowania, oraz różnorakiego ułożenia tych bloków. Posiada też estetyczny zapis tagów… bez tagów. Kod staje się o wiele przejrzystszy."
        },
        "less": {
            "title": "LESS",
            "description": "LESSa używam wtedy, gdy korzystam z Apache, ponieważ można go wtedy łatwo dodać do aplikacji. Nie zdarza mi się często korzystać z mixinów lecz wiem do czego służą. Podoba mi się w nim strukturyzacja CSSa oraz możliwość stosowania zmiennych i ich importowania."
        },
        "sass": {
            "title": "SASS",
            "description": "Używam go w większych projektach, jednak wykorzystuję go w identycznych celach jak LESSa. Nie widzę w nich większych różnic oprócz technologii na których zostały napisane."
        },
        "symfony": {
            "title": "Symfony",
            "description": "Był to pierwszy framework na którym robiłem swoje projekty. Był wtedy jeszcze w wersji 3. Nauczyłem się na nim funkcjonować w modelu MVC, niestety wtedy nie korzystałem zbytnio z DRY i kopiowałem kod jak popadło. Framework ten był bardzo duży i w pełni synchroniczny. Z tego co pamiętam był strasznie nieintuicyjny i trudny, jednak po przesiadce na Node.js nic mnie już nie zaskoczyło."
        },
        "sfml": {
            "title": "SFML",
            "description": "Idealna biblioteka do rozpoczęcia nauki tworzenia gier. Od niej zacząłem i ciekawie mi się z niej pracowało. Czasami bywała tak nieintuicyjna, że 5 godzin zajęło mi, żeby spróbować użyć wskaźnika do pobrania obrazów z dysku. Niestety jest zbyt mało informacji w internecie o błędach, które mogą w niej wystąpić. Zrobiłem w niej jedną grę z 3-ma poziomami jak na razie. Myślę, że kiedyś zajmę się tworzeniem innych gier w Uniity, bo bardzo mi się spodobało."
        },
        "flstudio": {
            "title": "FL Studio",
			"description": "Umiem tworzyć podstawowe beaty i korzystać z wbudowanych instrumentów VST i narzędzi. Jeszcze się wszystkiego uczę, ale moje prace mnie bardzo zadowalają jak na razie. Ostatnio postanowiłem skorzystać z instrumentów zewnętrznych, a także nagrać wokal do podkładu. Na początku program ten był bardzo nieintuicyjny dla mnie, ale z biegiem czasu udało mi się go opanować."
        },
        "audacity": {
            "title": "Audacity",
			"description": "Z tego programu korzystałem do swoich pierwszych przeróbek i montaży wokalu. Robiłem w nim przeróbki z Alvinem i Wiewiórkami, które potem publikowałem. Lubie w nim nagrywać audio, ponieważ jest to o wiele łatwiejsze i bardziej intuicyjne niż w flstudio."
        },
        "sonyvegas": {
            "title": "Sony Vegas",
			"description": "Od tego programu zaczynałem montaż filmów. Umiem z nigo podstawy, takie jak cięcia, przejścia, wejścia, napisy. Montowałem w nim filmiki potrzebne często do szkoły. Nie mam niesamowitego procesora do renderu większych rzeczy, oraz dużego dysku do pomieszczenia rezultatów, jednak udało mi sie w nim zmontować swoje filmy z wycieczek na Islandii."
        },
        "hitfilm": {
            "title": "Hitfilm",
			"description": "Montowałem w nim filmy niewiele razy i nie mam niewiadomo jakiego doświadczenia z nim związanego. Myślę, że ciekawszym programem jest Sony Vegas, jednak Hitfilm jest programem w pełni darmowym i zawsze go polecam ludziom, którzy nie mają większego doświadczenia w montażu."
        },
        "word": {
            "title": "Word",
			"description": "Z programu tego korzystam od kiedy pamiętam. Wiem o nim wiele (nie jestem z osób, które używają enterów, żeby dostać się na spód strony). Umiem tworzyć dokumenty w stylu formalnym i nieformalnym, oraz te, które mają mieć wygląd typowo estetyczny."
        },
        "excel": {
            "title": "Excel",
			"description": "Z arkusza kalkulacyjnego korzystałem na maturze i na studiach. Umiem tworzyć wykresy, używać różnych funkcji do działania na danych, warunkowych i logicznych. Większość zadań jest mi niestraszna, jednak znam osoby które potrafią znaleźć wyjście z bardziej złożonych problemów, z którymi sobie nie radzę. Przy podstawowych i tych bardziej zaawansowanych obliczeniach na pewno dam sobię radę."
        },
        "powerpoint": {
            "title": "Powerpoint",
			"description": "Większość prezentacji tworzonych przeze mnie była właśnie w powerponcie. Nawet kiedyś stworzyłem w nim grę do szkoły. Nie muszę sie o nim zbytnio rozpisywać - znam znaczną większość możliwości tego programu."
        },
        "access": {
            "title": "Access",
			"description": "Obsługi tej bazy danych uczyłem się na maturę. Z tego co pamiętam to te zadania sprawiały mi najmniejszą trudność zawsze. Wiem z niej to wszystko co umiałbym zrobić w SQLu."
        },
        "outlook": {
            "title": "Outlook",
			"description": "Z tego menedżera poczty korzystałem na islandii. Odbierałem w nim pocztę i oznaczałem zadania w kalendarzu praktycznie codziennie."
        },
        "polish": {
            "title": "Język polski",
            "description": "Nie muszę zbyt wiele o nim pisać – mój język ojczysty, mówię w nim od zawsze."
        },
        "english": {
            "title": "Język angielski",
            "description": "Operuję w nim dobrze zarówno w mowie jak i w piśmie – na pewno na tyle wystarczająco, że znalazłem pracę jako recepcjonista na Islandii. Zdałem na certyfikat ACERT-B2 na studiach, jednak do tej pory go nie otrzymałem do ręki. Sądzę jednak, że jestem gdzieś w okolicach C1 – rozumiem co do słowa, co mówią w filmach na Youtube bez napisów. Z pełnometrażowymi filmami jest tylko trochę gorzej (czytam napisy tylko, kiedy chcę zrozumieć treść w 100%, a nie 80). Jeżeli chodzi o rozmowę to zbytnio nie mam z nią problemów, staram się mówić płynne i żywo, czasem zapomnę słowa. Na egzaminie ustnym, na certyfikat miałem 18/20 punktów."
        },
        "german": {
            "title": "Język niemiecki",
            "description": "Tutaj znam tylko podstawy. Rozmawiając z Niemcami używam podstawowych słów, jednak staram się robić to poprawnie. Jak na razie nigdy nie miałem problemów z prostą rozmową, kiedy rozmówcy starali się mówić powoli i powtarzać co powiedzieli. Umiem to czego nauczyłem się w gimnazjum i liceum."
        },
        "russian": {
            "title": "Język rosyjski",
            "description": "Tego języka uczę się dla zabawy. Jest na tyle podobny do polskiego, że słowa łatwo wchodzą do głowy. Myślę, że sam język znam w podobnym stopniu co niemiecki. Mam znajomych z Rosji, lecz najczęściej rozmawiamy po angielsku. Umiem powoli czytać cyrylicę."
        }
    },
    "experience": {
        "menu": {
            "title": "Doświadczenie",
            "subtitle": "Tutaj można zobaczyć szkoły w których się uczę oraz przebyte staże"
        }, 
        "schools": {
            "main_title": "Szkoły do których uczęszczam lub jestem ich absolwentem", 
            "lo3": {
                "title": "3 Liceum Ogólnokształcące w Poznaniu o profilu matematyczno-fizyczno-informatycznym",
                "text": "Do szkoły tej chodziłem przez 3 lata od 2015 do 2018 roku. Najbardziej lubiłem w niej mimo wszystko podstawy przedsiębiorczości, geografię i biologię. Był w niej duży nacisk na matematykę i informatykę, które jako rozszerzone zdawałem na maturze. Poznałem tu bardzo inteligentnych ludzi."
            },
            "pp": {
                "title": "Politechnika Poznańska wydział Informatyki i Telekomunikacji",
                "text": "Jestem już prawie na trzecim roku studiów inżynierskich. Studia te stanowią dla mnie jedynie rozszerzenie wiedzy informatycznej i na razie traktuję je jako ciekawostkę. Wszystkich najpotrzebniejszych rzeczy uczę się sam. Wyniosłem stąd wiedzę jak działać z asemblerem, linuxem, mikroprocesorami, itd."
            }
        },
        "jobs": {
            "title": "Staże",
            "geotech": {
                "title": "Wizytówka firmy Geo-Tech (w trakcie)",
                "text": "Na zaliczenie praktyk studenckich wykonałem w technologii Wordpress wizytówkę dla firmy geologicznej z Piły."
            },
            "fourthFloor": {
                "title": "Recepcjonista 4th Floor Hotel w Reikjawiku",
                "text": "Szalona podróż na Islandię latem 2019 roku, którą będę wspominał latami. Pracowałem przez 2 miesiące na stanowisku recepcjonisty w niewielkim hotelu w Rejkiewiku. W przerwach pomiędzy obsługą klientów w języku angielskim i walką z ich PMSem pisałem im ułatwiające życie skrypty do przeglądarki. Zwiedziłem przy okazji Reikjawik jak i dużą część Islandii na wycieczkach."
            }
        }
    }
}